{
    "https://angrau.ac.in/#carouselExampleIndicators": "ANGRAU Previous Next EVENTS/FLASH NEWS Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 Click Here Reopening of admissions into specified major subject groups of PG courses Click Here Application cum information brochure for admission into B.sc (Hons) Community science for AY 2024-25 Left Over Seats - Last date for submission of application - 18-11-2024\r\nManual counseling on 18-11-2024 at Krishna Auditorium, RARS, ANGRAU, Lam, Guntur-522 034 (Final phase) Click Here Application cum information brochure for UG admissions under NRI / in lieu of NRI AY 2024-25 Left Over Seats - Last date for submission of application -  18-11-2024 Manual counseling on 19-11-2024 at O/o Controller of Examinations, Administrative Office, ANGRAU, Lam, Guntur-522 034 - (Final phase) Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 Click Here Third Counseling (Manual) for admission into B.Sc (Hons) Agriculture / B.Tech (Food Technology) courses of ANGRAU for AY 2024-25 from 04-11-2024 to 08-11-2024 at Krishna Auditorium / APGC Seminar Hall, RARS, Lam farm, ANGRAU, Guntur Click Here Public Notice for Ph.D. Application extension Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click here Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks from 17-10-2024 to 22-10-2024 Click Here Career Advancement Scheme - Calling of applications for 5th to 7th batches during the period of eligibility form 01.01.2023 to 30.06.2024 - Cancelled Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 Click Here PG and Ph.D Admissions for the  Academic year 2024-25 Click Here CAREERS Click Here Inviting the application for admission into the NRI / In lieu of NRI quota in P.G and Ph.D Programmes for the Academic Year 2024-25 Click Here ANGRAU AGRICET 2024 Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Diploma Registration Link.. Click Here National Anti Ragging Helpline Click Here Viksit Bharat Click Here Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 - Click Here Reopening of admissions into specified major subject groups of PG courses - Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 - Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 - Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 - Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks - Tentatively from 17-10-2024 to 22-10-2024 First counseling (Manual) for Admission into PG & Ph.D. Programme under NRI/in lieu of NRI Quota for the Academic Year 2024-25 on 09-10-2024. Master question papers with Final keys for AGRICET 2024 uploaded Time limit for submission of online application for PG and Ph.D Admissions for the Academic Year 2024-25 is extended up to 10-10-2024 at 11:59 PM PG and Ph.D Admissions for the  Academic year 2024-25 - Click Here National Anti Ragging Helpline - Click Here PG and Ph.D Admissions for the Academic Year 2024-25 Under NRI / In lieu of NRI Quota - Click Here Application cum information brochure for admissions into B.Sc. (Hons) Community Science AY 2024-25 Last Date 29-07-2024 - Extended upto 30-08-2024 - Click Here 12 days Agricultural Drone Pilot Training Programme at ANGRAU RPTO Application cum information brochure for admissions under NRI / in lieu of NRI AY 2024-25 - Last date 25-07-2024 extended upto 13-08-2024 - Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Viksit Bharat @ 2047 Fulbright-Nehru and other Fulbright Fellowships for study, research, teaching and profesional development in the U.S. APPLY NOW! For details CLICK HERE ICAR - Accreditation Certificates NIRF Live Meetings Circulars/Notifications Regulations RTI act SC/ST Cell Women Protection Cell Agricultural Market Intelligence IDP Open Distance Learning Centre (ODLC) Publications Portals Digilocker - NAD/ABC Alumni Awards & Honours IPR & Patents ANGRAU Agri Business Incubator Application Form to be a new Voter Study in India (SII)(for Foreign Students) Vice-Chancellor’s Message It is a matter of immense pleasure and privilege to be part of an esteemed alma mater Acharya N.G. Ranga Agricultural University in the capacity of Vice-Chancellor. Under dynamic leadership of predecessor Vice-Chancellors of ANGRAU, the state of Andhra Pradesh has witnessed quantum leap in the food productivity and production through agro-climate based, location specific research strategies of multi-faceted crops covering cereals, pulses, oilseeds, major and minor millets. Read More Dr. R. Sarada Jayalakshmi Devi Vice - Chancellor ADMISSIONS AY 2024-25 Click Here LATEST RELEASED VARIETIES / TECHNOLOGIES Click Here ANGRAU CROP VARIETIES Click Here ANGRAU TECHNOLOGIES Click Here 4 UG Programmes 22 PG Programmes 16 Ph.D. Programmes 4 Diploma Courses 12 Constituent Colleges 6 Affiliated Colleges 21 Constitutent Polytechnics 59 Affiliated Polytechnics 6 Regional Agricultural Research Stations 27 Research Stations 37 AICRP Schemes 26 KVKs(13) DAATTCs(13) LATEST ANNOUNCEMENTS Careers ACADEMIC CALENDAR / EXAMS Tenders Click Here for more Applications and Walkin Interviews Click Here E- Procurement tenders are invited from the printer and publisher for designing, printing and supply of Vyavasaya Panchangam 2025–26 books and supply at Agricultural Information & Communication Centre, Acharya N. G. Ranga Agricultural University, Lam, Guntur, Andhra Pradesh on or before 30-11-2024 at 05:00 PM Click Here Click here for Academic Calendar/Exams Click Here OUR GALLERY Photo Gallery Video Gallery Electronic Wing Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in Farmer call Center : 1800-425-0430 farmercallcentre@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012000 Designed and Developed By ×",
    "https://angrau.ac.in/ANGRU/ADMISSIONS_AY_2022_23_REDIRECTION.aspx?value=LIUP7Lf3t07dWpPTGLCpWg==": "ANGRAU Home ADMISSIONS AY 2024-25 ADMISSIONS AY 2024-25 Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 - Click Here Third Counseling (Manual) for admission into B.Sc (Hons) Agriculture / B.Tech (Food Technology) courses of ANGRAU for AY 2024-25 from 04-11-2024 to 08-11-2024 at Krishna Auditorium / APGC Seminar Hall, RARS, Lam farm, ANGRAU, Guntur - Click here Announcement of results for second phase web options : 23-10-2024 by 4.00 P.M Physical reporting of students at allotted colleges : 24th - 26th October, 2024 Sports Priority List 2024-25 for admission into B.Sc.(Hons) Agriculture & B.Tech.(Food Technology) - Click Here B.Sc. (Hons) Agriculture & B.Tech. Food Technology - NCC Priority List 2024-25 - Click Here 2nd Phase web options guidelines  - Click Here 2nd Phase Web-Options - 15th & 16th October, 2024 (2days) APEAPCET 2024 Online admissions B.Sc. (Hons) Agriculture & B.Tech. Food Technology - Tentative priority list of Physically Challenged (PH) - Click Here Tentative priority list of Scouts & Guides - Click Here APEAPCET 2024 Online admissions B.Sc. (Hons) Agriculture & B.Tech. Food Technology - CAP Priority List - Click Here Online Registration for admission into B.Sc.(Hons) Agriculture & B.Tech (Food Technology) Bi.P.C. Stream for the Academic year 2024-25 - Click Here Last ranks of candidates for B.Sc.(Hons) Agriculture under convenor quota for AY 2023-24 - Click Here Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012010 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/ADMISSIONS_AY_2022_23_REDIRECTION.aspx?value=pvGwfixRtW1aoQ5jlQ2bLA==": "ANGRAU Home ADMISSIONS AY 2024-25 ADMISSIONS AY 2024-25 Reopening of admissions into specified major subject groups of PG courses - Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 - Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 - Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 Seat matrix of PG Admissions for AY 2024-25 Notification Application Registration link Information Brochure for PG & Ph.D Admissions Final Schedule of PG  programme Admissions for Academic Year 2024 Admission into M.Sc.(Ag.) under In-service Quota Admission into Ph.D. under In-service Quota Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012017 Designed and Developed By",
    "https://angrau.ac.in/downloads/Admissions/BScCommunityScience/Community Science 2024 Revised (1).pdf": "",
    "https://angrau.ac.in/downloads/Admissions/NRI_UG/NRI Application with Brochure 24-25 (18-11-2024).pdf": "",
    "https://angrau.ac.in/downloads/Admissions/BScAgriculture/Third Phase Manual Counselling AP EAPCET 2024.pdf": "",
    "https://angrau.ac.in/downloads/Events/Public Notice for Ph.D. Extension.pdf": "",
    "https://apangrau-agricetadmissions.aptonline.in/AGRICET/": "AGRICET 10.100.101.189 Home Contact us College/Dept.Login Forms Web options Print Application Form Download of Allotment Order Know Your Payment Status Know Your Registration (Application/Verification Status) INFORMATION BULLETIN / Downloads Guidelines to exercise web options for admission into B.Sc(Hons) agriculture AGRICET Information Brochure 2024. Important Dates Web options through AGRICET 2024 Ranks : 28/10/2024 to 30/10/2024 Special category certificate verification (Physically at O/o Controller of Examinations, Administrative Office, ANGRAU, Lam, Guntur): 1st November, 2024 (10.00 AM to 4.00 PM) Results : 08-11-2024 at 9.00 P.M Physical Reporting at College : Announced soon © Copy Rights Reserved with AGRICET. Designed and Developed by",
    "https://angrau.ac.in/downloads/Circulars_Notifications/1544.pdf": "",
    "https://angrau.ac.in/ANGRU/ADMISSIONS_AY_2022_23_REDIRECTION.aspx?value=WTdrQu2/3/0FNRdXOBsRlQ==": "ANGRAU Home ADMISSIONS AY 2024-25 ADMISSIONS AY 2024-25 First counseling (Manual) for Admission into PG Programme under NRI/in lieu of\r\n                                                     NRI Quota for the Academic Year 2024-25 on 09-10-2024. First counseling (Manual) for Admission into  Ph.D. Programme under NRI/in lieu of \r\n                                                    NRI Quota for the Academic Year 2024-25 on 09-10-2024. Notification Information Brochure for PG Admissions Application Form for PG Admissions Information Brochure for Ph.D Admissions Application Form for Ph.D Admissions List of ICAR Accredited / SAU Approved Colleges Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012018 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/Recruitment_Notification_2021.aspx": "ANGRAU Home Recruitment Notification 2024 Recruitment Notifications 2024 Walk-in-interview to work as Junior Research Fellow under the project \"Design & development of tractor powered single row parasol cotton picker for multi-picking practice of Indian farmer\" on contractual services at Regional Agricultural Research Station, Tirupati on 20-11-2024 at 10:00 AM Walk-in-interview for the post of Young Professional-I (01) purely temporary on contract basis under  \"AICRP on IFS Scheme\" at Agricultural Research Station, Gajularega, Vizianagaram on 20-11-2024 at 11:00 AM Walk-in-Interview for the post of Teaching Associate (1 No.) in the department of Horticulture on full time contract basis (Temporary basis) at at Agricultural College, Bapatla on 22-11-2024 at 11:00 AM Walk-in-Interview for the post of Teaching Associate(1 no.) in the discipline of Agricultural Engineering on full time contract basis (Temporary basis)  at Agricultural College, Naira on 22-11-2024 at 11:00 AM Walk-in-Interview for engaging Part time Doctor purely on temporary and contractual basis at Polytechnic of Organic Farming, RARS, Chintapalle on 30-11-2024 at 11:00 AM Walk-in-Interview for the post of Teaching Associate on full time contractual basis in the Department of Plant Pathology at Agricultural College, Rajamahendravaram on 20-11-2024 at 10:30 AM Walk-in-interview for the post of Young Professional-II (1 No.) temporary contract basis to work under NFSM - Special project on Cotton at RARS, Nandyal on 18-11-2024 at 10:00 AM Walk-in-interview for the post of Young Professional-I (01) purely temporary on contract basis under  \"All India Co-ordinated Research Project on Agrometeorology - NICRA project\" at RARS, Nandyal on 18-11-2024 at 10:00 AM Walk-in-interview for the post of Teaching Associate on contract and full time basis in the Department of Soil Science & Agricultural Chemistry at SMGR Agricultural College, Udayagiri on 22-11-2024 at 10:30 AM. Walk-in-Interview for the post of Teaching Associates(2 No.) in the department of Horticulture on full time contract basis (Temporary basis) at SMGR Agricultural College, Udayagiri on 21-11-2024 at 02:00 PM Walk-in-Interview for the post of Teaching Associates(2 No.) in the department of Agronomy on full time contract basis (Temporary basis) at SMGR Agricultural College, Udayagiri on 21-11-2024 at 11:00 AM Walk-in-interview for engaging part time Medical Officer purely on temporary and contractual basis at Agriculture College Naira on 20-11-2024 at 11:00 A.M. Walk-in-Interview for the post of Medical Officer on contract basis(Part Time) at College of Food Science & Technology, Pulivendula on 27-11-2024 at 11:00 A.M. Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012040 Designed and Developed By",
    "https://angrauagricet.aptonline.in/": "",
    "https://polytechnicadmissionsangrau.aptonline.in/ANGRAUPOLY/": ":: ANGRAU :: Toggle navigation HOME ABOUT US REPORTS CONTACT US LOGIN Spot Counselling for Unregistered candidates : 10:00 AM to 05:30PM on 13.09.2024 at Krishna Auditorium, ANGRAU, Lam, Guntur. APPLICATION FORMS Know Your Payment Status Know Your Applicant Status After verification Registration Print INFORMATION BULLETIN Information bulletin for Diploma in ANGRAU 2024-2025 Spot counseling IMPORTANT DATES © All Copy Rights Reserved Designed & Developed by × Information I agree that I have read all the instructions provided in the Information Bulletin pertaining to the Weboptions Processes. I would like to proceed with the Weboptions. No Yes,Proceed × Information I will submit the required/applicable certificates in original as per the list to the Principal of the Polytechnic, where I have been provisionally allotted at the time of physical reporting/admission failing which I forgot my admission and I will not enter into legal correspondence in this regard. No Yes,Proceed × Information I agree that I have read all the instructions provided in the Information Bulletin pertaining to the Online Admission Processes. I would like to proceed with the registration. No Yes,Proceed",
    "https://angrau.ac.in/UPLOADS/EventsPDFs/National Anti Ragging Help line.pdf": "",
    "https://angrau.ac.in/UPLOADS/EventsPDFs/ViksitBharat.pdf": "",
    "https://angrau.ac.in/": "ANGRAU Previous Next EVENTS/FLASH NEWS Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 Click Here Reopening of admissions into specified major subject groups of PG courses Click Here Application cum information brochure for admission into B.sc (Hons) Community science for AY 2024-25 Left Over Seats - Last date for submission of application - 18-11-2024\r\nManual counseling on 18-11-2024 at Krishna Auditorium, RARS, ANGRAU, Lam, Guntur-522 034 (Final phase) Click Here Application cum information brochure for UG admissions under NRI / in lieu of NRI AY 2024-25 Left Over Seats - Last date for submission of application -  18-11-2024 Manual counseling on 19-11-2024 at O/o Controller of Examinations, Administrative Office, ANGRAU, Lam, Guntur-522 034 - (Final phase) Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 Click Here Third Counseling (Manual) for admission into B.Sc (Hons) Agriculture / B.Tech (Food Technology) courses of ANGRAU for AY 2024-25 from 04-11-2024 to 08-11-2024 at Krishna Auditorium / APGC Seminar Hall, RARS, Lam farm, ANGRAU, Guntur Click Here Public Notice for Ph.D. Application extension Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click here Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks from 17-10-2024 to 22-10-2024 Click Here Career Advancement Scheme - Calling of applications for 5th to 7th batches during the period of eligibility form 01.01.2023 to 30.06.2024 - Cancelled Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 Click Here PG and Ph.D Admissions for the  Academic year 2024-25 Click Here CAREERS Click Here Inviting the application for admission into the NRI / In lieu of NRI quota in P.G and Ph.D Programmes for the Academic Year 2024-25 Click Here ANGRAU AGRICET 2024 Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Diploma Registration Link.. Click Here National Anti Ragging Helpline Click Here Viksit Bharat Click Here Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 - Click Here Reopening of admissions into specified major subject groups of PG courses - Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 - Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 - Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 - Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks - Tentatively from 17-10-2024 to 22-10-2024 First counseling (Manual) for Admission into PG & Ph.D. Programme under NRI/in lieu of NRI Quota for the Academic Year 2024-25 on 09-10-2024. Master question papers with Final keys for AGRICET 2024 uploaded Time limit for submission of online application for PG and Ph.D Admissions for the Academic Year 2024-25 is extended up to 10-10-2024 at 11:59 PM PG and Ph.D Admissions for the  Academic year 2024-25 - Click Here National Anti Ragging Helpline - Click Here PG and Ph.D Admissions for the Academic Year 2024-25 Under NRI / In lieu of NRI Quota - Click Here Application cum information brochure for admissions into B.Sc. (Hons) Community Science AY 2024-25 Last Date 29-07-2024 - Extended upto 30-08-2024 - Click Here 12 days Agricultural Drone Pilot Training Programme at ANGRAU RPTO Application cum information brochure for admissions under NRI / in lieu of NRI AY 2024-25 - Last date 25-07-2024 extended upto 13-08-2024 - Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Viksit Bharat @ 2047 Fulbright-Nehru and other Fulbright Fellowships for study, research, teaching and profesional development in the U.S. APPLY NOW! For details CLICK HERE ICAR - Accreditation Certificates NIRF Live Meetings Circulars/Notifications Regulations RTI act SC/ST Cell Women Protection Cell Agricultural Market Intelligence IDP Open Distance Learning Centre (ODLC) Publications Portals Digilocker - NAD/ABC Alumni Awards & Honours IPR & Patents ANGRAU Agri Business Incubator Application Form to be a new Voter Study in India (SII)(for Foreign Students) Vice-Chancellor’s Message It is a matter of immense pleasure and privilege to be part of an esteemed alma mater Acharya N.G. Ranga Agricultural University in the capacity of Vice-Chancellor. Under dynamic leadership of predecessor Vice-Chancellors of ANGRAU, the state of Andhra Pradesh has witnessed quantum leap in the food productivity and production through agro-climate based, location specific research strategies of multi-faceted crops covering cereals, pulses, oilseeds, major and minor millets. Read More Dr. R. Sarada Jayalakshmi Devi Vice - Chancellor ADMISSIONS AY 2024-25 Click Here LATEST RELEASED VARIETIES / TECHNOLOGIES Click Here ANGRAU CROP VARIETIES Click Here ANGRAU TECHNOLOGIES Click Here 4 UG Programmes 22 PG Programmes 16 Ph.D. Programmes 4 Diploma Courses 12 Constituent Colleges 6 Affiliated Colleges 21 Constitutent Polytechnics 59 Affiliated Polytechnics 6 Regional Agricultural Research Stations 27 Research Stations 37 AICRP Schemes 26 KVKs(13) DAATTCs(13) LATEST ANNOUNCEMENTS Careers ACADEMIC CALENDAR / EXAMS Tenders Click Here for more Applications and Walkin Interviews Click Here E- Procurement tenders are invited from the printer and publisher for designing, printing and supply of Vyavasaya Panchangam 2025–26 books and supply at Agricultural Information & Communication Centre, Acharya N. G. Ranga Agricultural University, Lam, Guntur, Andhra Pradesh on or before 30-11-2024 at 05:00 PM Click Here Click here for Academic Calendar/Exams Click Here OUR GALLERY Photo Gallery Video Gallery Electronic Wing Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in Farmer call Center : 1800-425-0430 farmercallcentre@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012046 Designed and Developed By ×",
    "https://angrau.ac.in/downloads/StudentAffairs/National Anti Ragging Help line.pdf": "",
    "https://angrau.ac.in/ANGRU/ADMISSIONS_AY_2022_23_REDIRECTION.aspx?value=dPpOTcZBSWf9EcPmhApXj4rEOafi4ahYQT9kgdD/9Nk=": "ANGRAU Home ADMISSIONS AY 2024-25 ADMISSIONS AY 2024-25 Application cum information brochure for admission into B.sc (Hons) Community science for AY 2024-25 Left Over Seats - Last date for submission of application -  18-11-2024 Manual counseling on 18-11-2024 at Krishna Auditorium, RARS, ANGRAU, Lam, Guntur-522 034 -(Final phase) - Click Here Manual counselling on 22nd and 23rd October, 2024 at 10:00 a.m. at O/o Controller of Examinations, Administrative Office, ANGRAU, Lam, Guntur-522 034 - Instructions to candidates - Click Here Application cum information brochure for admissions into B.Sc. (Hons) Community Science AY 2024-25 - Click Here Instructions to Applicants & Merit list - Manual Counselling (Second phase) for admission into B.Sc (Hons) Community Science for 2024-25 on 18-09-2024 at Krishna Auditorium, RARS, Lam - Click Here Application cum information brochure for admissions into B.Sc. (Hons) Community Science AY 2024-25 Last Date 29-07-2024 - Extended upto 30-08-2024 - Click Here Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012019 Designed and Developed By",
    "https://angrau.ac.in/downloads/Rolling Notification - 4th Spell 2024-25 15.07.2024.pdf": "",
    "https://angrau.ac.in/downloads/Admissions/NRI_UG/NRI Application with Brochure 24-25 date Extended.pdf": "",
    "https://innovateindia.mygov.in/viksitbharat2047": "Ideas for the Vision Viksit Bharat@2047 – Innovate India GOVERNMENT OF INDIA Skip to main content Language icon English हिन्दी - Hindi অসমীয়া - Assamese বাংলা - Bengali ગુજરાતી - Gujarati ಕನ್ನಡ - Kannada മലയാളം - Malayalam मराठी - Marathi ଓଡ଼ିଆ - Odia ਪੰਜਾਬੀ - Punjabi தமிழ் - Tamil తెలుగు - Telugu Login Accessibility Accessibility icon A + A A - A A Social Media Social Media Browse: Home Ideas for the Vision Viksit Bharat@2047 Submission Closed Prizes for Best Ideas Follow the WhatsApp channel to receive information about the Viksit Bharat@2047: Voice of Youth विकसित भारत@2047: युवाओं की आवाज के बारे में जानकारी प्राप्त करने के लिए व्हाट्सएप चैनल को फॉलो करें । Follow Now Viksit Bharat@2047 Date: 11 December, 2023 My colleague in the Union Cabinet, Dharmendra Pradhan ji, the Governors who have joined us from across the country, eminent personalities from the world of education, ladies and gentlemen! Today is a very important day regarding the resolutions of a developed India. I would like to specially congratulate all the Governors that they have arranged this workshop related to building a developed India. You have brought on one stage those friends who have the responsibility of giving direction to the youth power of the country. The role of educational institutions is to develop the person, and only through the development of the person, the nation is built. And in the period in which India today is, the campaign of personality building has become of utmost importance. I wish you all the best for the success of the Voice of Youth Workshop. Friends, History gives every country a period when it advances its development journey manifold. In a way, this is the golden age (Amritkaal) of that country. This is the golden age (Amritkaal) for  India. This is the period in India's history when the country is going to take a quantum leap. There are examples of many such countries around us, which have developed themselves by taking a similar quantum leap in a given time. That is why I say; this is the right time for India as well. We have to take advantage of every moment of this golden age; we should not waste even a single moment. Friends, For inspiration, we all have our long struggle for freedom before us. When we entered the field with one goal, with one zeal and passion, considering freedom as the ultimate goal, we were able to achieve success. During this period, Satyagraha, the path of revolution, awareness about Swadeshi, consciousness of social and educational reforms, all these streams together became the strength of the freedom movement. During this period, many such institutions like Kashi Hindu University, Lucknow University, Visva Bharati, Gujarat Vidyapith, Nagpur University, Annamalai University, Andhra University, and University of Kerala strengthened the consciousness of the country. This was the period when a new consciousness about freedom was engrained within the youth of every section. An entire young generation came forward dedicated to freedom. A thought was formed in the country that whatever has to be done, has to be done for the sake of freedom and has to be done now. Someone used to spin the charkha and that too for freedom. Someone used to boycott foreign goods, that too for the sake of freedom. Someone used to recite poetry, that also for freedom. Someone used to write in a book or newspaper, that too for freedom. Someone used to distribute newspaper pamphlets and that also for freedom. Similarly, today every person, every institution, every organization has to move forward with the pledge that whatever I do should be for a developed India. The aim of your goals, your deliverance should be only one – developed India. As a teacher, think about what you will do to help the country in achieving the goal of a developed India? As a university, you should think about what to do so that India develops rapidly? What should happen in the region where you are, how should India move forward rapidly on its path of becoming developed? Read more Friends, Whichever education institutes you represent, you have to channelize the youth energy of the country for this one goal. Every youth who comes to your institutions comes with some characteristics or the other. His ideas, no matter how diverse they are, have to be linked to the stream of building a developed India. I would like all of you to think beyond your limits to contribute to the vision of Viksit Bharat@2047. So that more and more youth can join this campaign in every college and university of the country, for this also you should run special campaigns, take leadership, and express things in a simple language. Today the Viksit Bharat@2047 section has been launched inside MyGov. It has a section of Ideas for the vision of a developed India. And because the idea starts with ‘I’, it needs such ideas which describe what I can do myself. And just as ‘I’ is first in an idea, ‘I’ is also in India. That means, if we want success, want to achieve our goals, want to get proper results, and then it starts from our own ‘I’. Suggestions can be given on 5 different themes on this online ideas portal on MyGov. A prize has also been arranged for the best 10 suggestions. Read more Friends, When I talk about suggestions, the sky is wide open in front of you. We have to prepare such an immortal generation in the country, which will become the leader of the country in the coming years, which will give leadership and direction to the country. We have to prepare such a young sapling of the country, who will keep the national interest supreme, who will keep his duties supreme. We do not have to be limited to just education and skills. As a citizen, it is necessary to increase efforts in this direction to ensure that the citizens of the country remain alert 24 hours a day. We have to bring that consciousness into society, whether cameras are installed or not, people should not jump the red light of traffic. People should have such a high sense of duty that they reach office on time and go ahead to work to fulfill their responsibilities. Whatever product is made here, its quality should be so good that seeing it as Made in India increases the pride of the buyer. When every citizen of the country, whatever role he plays, starts performing his duties, the country will also move forward. Now it is a topic related to the use of natural resources. When seriousness will increase regarding water conservation, when seriousness will increase regarding saving electricity, when the use of chemicals will reduce to save mother earth, when there will be seriousness towards maximum use of public transport, then the society, the country, everywhere will have a huge positive impact in the area. I can give you many such examples. You will also agree that these are small things but their impact is very big. Your suggestions will also be important in rejuvenating the public movement for cleanliness. Your suggestions will be important for how our youth can combat the side effects of modern lifestyle.Besides their virtual worlds, it's essential for the youth to explore the world around them. As an educator, it's your responsibility to instill many such ideas in both the present and future generations. You must also embody a role model for your students. When citizens prioritize the country's welfare, it lays the foundation for a robust society. As you know, societal perspectives often reflect in governance and administration. If I talk about the field of education, there are many subjects related to it. While educational institutions grant certificates and degrees after several years of study, shouldn't we ensure that each student acquires practical skills?  Only such discussions and suggestions related to them will clear the path towards a developed India. Therefore, you should proceed as a comprehensive process of brainstorming on these topics in every campus, every institute and at the state level. Read more Friends, This is the golden age (Amrit kaal) of building a developed India akin to the days preceding examinations.  students exhibit great confidence in their exam preparation, yet they tirelessly practice until the last moment. Every student dedicates their time and efforts toward a singular goal. When exam dates are announced, it feels as though the entire family prepares, not just the students. As citizens of this country, our \"exam date\" has also been declared. We have 25 years of Amritkaal ahead to work tirelessly, striving for the goal of a developed India. Establishing this environment as a collective family responsibility is incumbent upon us all.\n\t\t\t\t\t\t\t\tstudents exhibit great confidence in their exam preparation, yet they tirelessly practice until the last moment. Every student dedicates their time and efforts toward a singular goal. When exam dates are announced, it feels as though the entire family prepares, not just the students. As citizens of this country, our \"exam date\" has also been declared. We have 25 years of Amritkaal ahead to work tirelessly, striving for the goal of a developed India. Establishing this environment as a collective family responsibility is incumbent upon us all. Read more Friends, Today the world's population is rapidly aging and India is empowered by youth power.Experts predict India will lead in terms of a working-age population for the next 25-30 years. That's why the whole world looks up to the youth of India. Youth power is the agent of change and the beneficiaries of change as well. These 25 years are going to decide the career of the young friends who are in colleges and universities today. These youths are going to create new families and create a new society. Therefore, it is our youth who have the biggest right to decide how a developed India should be. With this spirit, the government wants to connect every youth of the country with the action plan of a developed India. Government wants to mould the voice of the country's youth into the policy-strategy to build a developed India. Given your strong connections with the youth, your contribution and that of your peers are pivotal in this endeavour. Read more Friends, The  road of progress that we want to take will not be decided by the government alone, it will be decided by the country. Every citizen of the country will have input and active participation in it. Everyone's effort, i.e. public participation, is a mantra by which even the biggest resolutions can be accomplished. Be it Swachh Bharat Abhiyan, Digital India Abhiyan, fight against Corona or being vocal for local, we all have seen the power of collective efforts. A developed India has to be built only through collective  efforts. All of you scholars are also the people who shape the vision of the country's development and channelize the youth power. Thus the expectations from you are much higher. This is a great campaign to write the future of our country. Your each suggestion will enhance the grandeur of the building of developed India. Once again, I wish you all the best for today's workshop. I firmly believe that starting today, together, by 2047, we can build a developed India. The journey begins now; leadership rests in the hands of academicians, students, and educational institutions during this era of nation-building. I extend my heartfelt best wishes to all. Read more Read more Prizes for Best Ideas In each of the 5 thematic areas, 3 prizes will be awarded to the best ideas: First Prize: Rs. 5 lakhs Second Prize: Rs. 3 lakhs Third Prize: Rs. 2 lakhs Submission Closed TransformingIndia MyGov Blog MyGov Quiz Pledge Campus Ambassador Saathi Contact Us Terms and Conditions MyGov Follow us MyGov Twitter MyGov Facebook MyGov YouTube MyGov Instagram MyGov WhatsApp MyGov LinkedIn MyGov Messenger © Content owned, updated and maintained by the MyGov Cell. This website belongs to MyGov , Ministry\n                           of Electronics & Information Technology , Government of India . Platform is designed, developed and hosted by National Informatics Centre . Download MyGov Mobile App And Continue to Contribute Towards Building a New India on the Move Copyright © MyGov 2014 Last Updated: Nov, 2024 -\n   aexa-iindiaweb01",
    "https://www.usief.org.in": ":: Welcome to USIEF :: jee main result Site Web Home About USIEF News & Events Useful Links Contact Us Newsletter Winter 2022 Spring 2021 Summer 2021 Autumn 2021 Blog USIEF EducationUSA India USIEF Announcements 2024 Student Visa Fact Sheet Your U.S. higher education journey begins here EducationUSA at USIEF Annual Memberships Update Click for a list of EducationUSA events and sessions Read More Connect with EducationUSA India New Delhi | Chennai | Hyderabad | Kolkata | Mumbai Email: india@educationusa.org Toll-Free (Monday through Friday, 10:00 am to 5:00 pm) 1800 103 1231 +91 7428932225 Click here to get EducationUSA updates Find free upcoming EducationUSA events here Fulbright Fellowships Study in the U.S. Institutional Collaboration interracial dating sites Study in India Current Fellows Alumni Feedback Form | Job Opportunities | Disclaimer | Privacy Policy | Terms & Conditions | Site Map Staff Login © 2011 USIEF - All Rights Reserved. This website is best viewable at internet explorer version 9",
    "https://angrau.ac.in/ANGRU/ICAR_Accreditation_Certificates_Redirection.aspx": "ANGRAU Home ANGRAU - ICAR-Accreditation Certificates ANGRAU - ICAR-Accreditation Certificates 2017 - 2021 - ICAR Accreditation Certificate 2008 - 2011 - ICAR Accreditation Certificate 2021 - 2026 - ICAR Notification - ANGRAU Accreditation - Brief SVBR Agriculture College,Badvel - ICAR Accreditation N.S. Agricultural College, Markapurl - ICAR Accreditation Sri Krishna Devaraya College of Agricultural Sciences, Anantapuramu - ICAR Accreditation Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012020 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/NIRF_Redirection.aspx": "ANGRAU Home ANGRAU-NIRF ANGRAU-NIRF-RANKING ANGRAU-NIRF-2023 ANGRAU-NIRF-2024-Agriculture & allied sectors ANGRAU-NIRF-2024-Overall Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012021 Designed and Developed By",
    "https://www.agricultureinformation.com/meeting-angrau/": "Failed to retrieve data",
    "https://angrau.ac.in/ANGRU/Circulars_Notifications.aspx": "ANGRAU Home Circulars / Notifications Circulars / Notifications Career Advancement Scheme - Calling of applications for 5th to 7th batches during the period of eligibility form 01.01.2023 to 30.06.2024 - Cancelled Click Here Technology and Bharatiya Bhasha Summit Click Here ICAR Notification - ANGRAU Accreditation Click Here Renewal of Certificate of Registration registered with DSIR as University for availing Customs Duty Exemption and GST benefits - Certain information Click Here Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012022 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/Regulations.aspx": "ANGRAU Home Regulations Regulations Diploma ACADEMIC Regulartion of the Polytechnic 2018 Catologue of Diploma in Agricultural Engineering-Unit-wise Syllabas and Lecture Outlines UG B.Sc Agriculture Course outlines of B.Tech (Ag Engg) Course outlines of B.Tech (Food Tech) Regulations for UG admissions UG Regulations Postgraduation Antiplagiarism regulations Course catalogue of the Post Graduate Part 1 Course Catlage Part 2 PG Forms Regulation for student evaluation and examinations Regulation of post graduates Thesis submission guidelines UGC 2016 CAS Application 2016 CAS 2016 Application guidelines CAS 2019 Modified Regulations ANGRAU Score Card-Agriculture UGC 2016 Regulations ANGRAU UGC Gazette 18.07.2018 Miscellaneous Fifth Deans Commitee Report GUIDELINES FOR ACCREDITATION GUIDELINES ON CONDUCT,DISCIPLINE AND WELFARE MEASURES FOR STUDENTS Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012023 Designed and Developed By",
    "https://angrau.ac.in/downloads/Homepage/RTI 2024 modified_04042024.pdf": "",
    "https://angrau.ac.in/downloads/Homepage/SC-ST Cell - New Officers for the year 2024-25.pdf": "",
    "https://angrau.ac.in/downloads/Women_Protection_Cell/Women Protection cell_0001.pdf": "",
    "https://angrau.ac.in/ANGRU/Agricultral-Market-Intelligence.aspx": "ANGRAU Home Agricultural Market Intelligence Agricultural Market Intelligence Previous Next AGRICULTURAL MARKET INTELLIGENCE CENTRE (AMIC), ANGRAU, Lam, GUNTUR – 522034. ABOUT CENTRE: In India, food grain production quadrupled during the last 50 years but failed to bring about a corresponding improvement in the standard of living of the vast majority of farm households, who depended on the agricultural sector for their livelihood security. The time has reached to concentrate more on the agricultural marketing policies and programmes rather than agricultural production policies. At present, the market prices couldn’t be determined only by the forces of supply and demand within the boundaries of a local area or a country and there is a marked asymmetry of access to market information. With this backdrop, Agricultural Market Intelligence Centre (AMIC) was established at ANGR Agricultural University, Lam, Guntur. AIM: To forecast the prices information of principal agricultural commodities and dissemination of better market information to farmers and other stakeholders to realize the better prices to their produce. OBJECTIVES: 1.\tTo provide pre sowing, pre harvest and at regular intervals the price forecasts for principal crops. 2.\tTo disseminate the forecasted prices information through various methods. 3.\tTo study the extent of market integration among major markets of agricultural commodities in Andhra Pradesh. 4.\tTo develop commodity market outlook, tracking commodity flows and commodity market research report for selected commodities at regional and state level. METHODOLOGY: Forecast models like Multiplicative model, Least Square Method, Co-integration test, Auto Regressive Integrated Moving Average (ARIMA) Model, ARCH, GARCH, ANN, SPSS (24 version) Software with multiple user, Metastock Software, E views (Latest version) Software, Alyuda Forecaster Software and other suitable statistical models are employed to get the valid estimates. CROPS COVERED: 1. Cotton 5.\tChillies 9.\tBengalgram 2.\tRedgram 6.\tBlackgram 10.\tGreengram 3.\tJaggery 7.\tMaize 11.\tSorghum 4.\tTurmeric 8.\tGroundnut MODE OF DISSEMINATION: The price forecasts estimated for different crops released during pre-sowing, mid season, pre and post harvesting stage are directly disseminated to the registered farmers through text as well as voice Short Message Services.  All these forecast bulletins were uploaded tothe websites of ANGRAU and the State Department of Agriculture and Agropedia, magazines viz., Vyavasayam of ANGRAU, Rythu Bharosa of Govt of AP and Annadata.  They are also made available with toll free FarmersCall Centre of ANGRAU and various departments of state government. FREQUENCY & ACCUARCY OF ESTIMATES: The price forecasts released by the centre were evaluated through impact assessment regularly. Price forecast releases especially matches with seasons (pre-sowing kharif, pre-harvest kharif, pre-sowing rabi, pre-harvest rabi) and in general monthly cum bi-monthly frequency. The accuracy of the forecasts were achieved between 86.54 to 96.38% for the crops under study when compared with the real-time market prices. COMMODITY OUTLOOK REPORTS: The fact sheets/crop outlook reports prepared by AMIC regularly for principal crops of Andhra Pradesh viz., chillies, cotton, sorghum, groundnut, turmeric, maize, blackgram, redgram, greengram and bengalgram which covers the recent information about area, production and productivity particulars of world, India, Andhra Pradesh and its districts; export and import scenario; procurement and consumption pattern; prices of crops in major mandis and price behavior along with forecasted price analysis. These reports can be viewed below. LINKAGES: Department of Agriculture, Department of Marketing, Civil Supplies Corporation and various market committees in addition to exporters and traders of different commodities in Andhra Pradesh. FUTURE COLLABERATIONS: The Centre is planning to build up a ‘Consortium’ by collaborating with the different public and private institutions in Andhra Pradesh as well as South Indian Agricultural Universities. IMPORTANT WEBSITES FOR FUTURE REFERNCE: www.des.ap.gov.in www.apagrisnet.gov.in https://eands.dacnet.nic.in https://www.agricoop.nic.in https://aps.dac.gov.in www.agriexchange.apeda.gov.in https://commerce.gov.in www.dahd.nic.in www.indianspices.com www.nhb.gov.in www.indiastat.com www.epwrfits.in www.agmarknet.gov.in www.enam.gov.in www.vyavasayamarketingsakha.ap.gov.in www.agriwatch.com https://fas.usda.gov/ https://www.fao.org/faostat/en/#home https://cotcorp.org.in Price Forecast Bulletins Piror to 2018-19 1-Rabi pre-harvest price forecasts for 2017-18 (Telugu version) 2-Rabi pre-harvest price forecasts for 2017-18 (English version) 3-Kharif pre-harvest price forecasts of redgram and turmeric- 2017-18 (English version) 4-Kharif pre-harvest price forecasts of redgram and turmeric- 2017-18 (Telugu version) 5-Kharif pre-harvest price forecasts of Red chillies 2017-18 (English version) 6-Kharif pre-harvest price forecasts of Red chillies 2017-18 (Telugu version) 7-Rabi pre-sowing price forecasts for 2017-18 (English version) 8-Rabi pre-sowing price forecasts for 2017-18 (Telugu version) 9-Kharif pre-harvest for Maize and greengram 2017-18 Telugu version 10-Kharif pre-harvest for Maize and greengram 2017-18 English version 11-Kharif pre-sowing price forecasts groundnut, sunflower, greengram, maize, redgram, cotton, chilli and turmeric for 2017-18 Telugu version 12-Kharif pre-sowing price forecasts groundnut, sunflower, greengram, maize, redgram, cotton, chilli and turmeric for 2017-18 English version 13-Bengalgram Rabi pre-harvest price forecast 2016-17 English version 14-Bengalgram Rabi pre-harvest price forecast 2016-17 Telugu version 15-Dry chilliKharif pre-harvest price forecast for 2016-17 English version 16-Dry chilliKharif pre-harvest price forecast for 2016-17 Telugu version 17-Kharif pre-harvest price forecasts of cotton and turmeric for 2016-17 English version 18-Kharif pre-harvest price forecasts of cotton and turmeric for 2016-17 Telugu version 19-Rabi pre-sowing price forecasts for 2016-17 English version 20-Rabi pre-sowing price forecasts for 2016-17 Telugu version 21-Kharif pre-harvest price forecasts for 2016-17 English version 22-Kharif pre-harvest price forecasts for 2016-17 Telugu version 23-Kharif pre-harvest price of chilli and rabi pre-harvest price forecasts of groundnut, sunflower and Bengalgram Tel. 2015-16 24-Kharif pre-harvest price forecast of Dry chilli Eng. 2015-16 25-Rabi pre-harvest price forecasts of groundnut, sunflower and Bengalgram Eng. 2015-16 26-Kharif pre-harvest Cotton &RedgramEng. 2015-16 27-Kharif pre-harvest Cotton&Redgram Tel. 2015-16 28-Rabi pre-sowing BlackgramEng 2015-16 29-Rabi pre-sowing Blackgram Tel. 2015-16 30-Kharif pre-harvest English version 2015-16 31-Kharif pre-harvest Telugu version 2015-16 32-Rabi pre-sowing English version 2015-16 33-Rabi pre-sowing Telugu version 2015-16 34-Kharif Pre-sowing Price Forecasts 2015-16 35-Kharif Pre-sowing Price Eng. 2015-16 Price Forecast Bulletins Price forecast bulletin (FR-30) for November & December, 2024 Price Forecast Bulletin (FR-29) for September & October Months for 2024 Price Forecast Bulletin (FR-28) for Kharif 2024-25 harvest prices Price Forecast Bulletin (FR-27) for March & April months for 2024 Price Forecast Bulletin (FR-26) for January & February months for 2024 Price Forecast Bulletin (FR-25) for November & December months for 2023 Price Forecast Bulletin (FR-24) for September & October months for 2023 Price Forecast Bulletin for Kharif crops 2023-24 at harvest time, FR-23 Price forecast bulletin for April & May 2023, FR-22 Price forecast bulletin Rabi season for February & March 2023, FR-21 Price forecast bulletin for Pre-Rabi season December 2022 & January 2023, FR-20 Price forecast bullitin for October & November 2022-23, FR-19 Price forecast bullitin for August & September 2022-23, FR-18 Pre-sowing price forecast bulletin for Kharif 2022-23 crop harvest season, FR-17 Price forecast bullitin April & May 2022, FR-16 Rabi pre-harvest price forecast bulletin for Februry & March, 2021-22, FR15 Kharif pre-harvest price forecast bulletin for December & January, 2021-22, FR-14 Kharif pre-harvest price forecast bulletin for October & November, 2021-22, FR-13 Price forecast bulletin for August & September 2021-22, FR-12 Kharif pre-harvest price forecast bulletin for 2021-22, FR-11 Price forecast bulletin for April & May 2020-21, FR-10 Price forecast bulletin for February & March 2020-21, FR-9 Rabi pre-harvest price forecast bulletin for 2020-21, FR-8 Kharif pre-harvest price forecast bulletin for 2020-21, FR-7 Kharif pre-harvest price forecast bulletin for 2020-21, FR-6 Price forecast bulletin for March & April 2019-20, FR-5 Pre-harvest price forecast bulletin for 2019-20, FR-4 Kharif pre-harvest price forecast bulletin for 2019-20, FR-3 Price forecast bulletin for April & May 2018-19, FR-2 Pre-harvest price forecast bulletin for 2018-19, FR-1 OutLook Reports 2022 Outlook Reports 1-MAIZE - January to December 2022 2-SORGHUM - January to December 2022 3-CHILLI - January to December 2022 4-COTTON - January to December 2022 5-TURMERIC - January to December 2022 6-REDGRAM - January to December 2022 7-BLACKGRAM - January to December 2022 8-GREENGRAM - January to December 2022 9-BENGALGRAM - January to December 2022 10-GROUNDNUT - January to December 2022 2021 Outlook Reports 1-BENGALGRAM – January to December 2021 2-BLACKGRAM – January to December 2021 3-CHILLI – January to December 2021 4-COTTON – January to December 2021 5-GREENGRAM– January to December 2021 6-GROUNDNUT– January to December 2021 7-MAIZE – January to December 2021 8-REDGRAM- January to December 2021 9-SORGHUM– January to December 2021 10-TURMERIC - January to December 2021 2020 Outlook Reports 1-BENGALGRAM OUTLOOK REPORT – January to December 2020 2-BLACK GRAM OUTLOOK REPORT – January to December 2020 3-CHILLI OUTLOOK REPORT – January to December 2020 4-COTTON OUTLOOK REPORT – January to December 2020 5-GROUNDNUT OUTLOOK REPORT – January to December 2020 6-MAIZE OUTLOOK REPORT – January to December 2020 7-REDGRAM OUTLOOK REPORT- January to December 2020 8-SORGHUM OUTLOOK REPORT – January to December 2020 9-TURMERIC OUTLOOK REPORT- January to December 2020 Brochures AMIC Brochure (English) AMIC Brochure (Telugu) Ugadi PAIO price forecast release 2022-23 Ugadi PAIO price forecast release 2021-22 Ugadi PAIO forecast price release 2020-21 Ugadi PAIO price forecast release 2019-20 Ugadi PAIO price forecast release 2018-19 Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012024 Designed and Developed By",
    "https://angrau.ac.in/downloads/ANGRAU_IDP%20_Information_converted.pdf": "",
    "https://angrau.ac.in/ANGRU/ODLC.aspx": "ANGRAU Home ODLC OPEN AND DISTANCE LEARNING CENTRE , LAM , GUNTUR Acharya N.G.Ranga Agricultural University being a pioneer University of the country in imparting Agricultural education is expanding its wings with the aim of reaching the unreached. Over the decades intensive efforts have been put forth by the Agricultural Scientists and Extension specialists in the state , still only less than 30 percent of agricultural technologies have reached the farmers. Considering the potential and the future of Open and Distance Learning, the Centre of Open and Distance Learning(ODLC) was established with the major aim being to transform ANGRAU from its formal educational system to a dual and convergent mode, by adopting appropriate policies and systems of ODL and ICT (Information & Communication Technology) so as to provide entrepreneurial skills for self-employment, continuing professional education and extension education to the rural people of the state. Establishment of Open Distance Learning Centre under the Faculty of Agriculture , ANGRAU will be vested with the responsibility of offering Distance learning programme through corresponding mode viz., certificate courses and Diploma courses for the benefit of various segments of the farming community , entrepreneurs , Self help groups and other learners who aspire for knowledge in Agricultural education and Self employment. Objectives : The objectives of ODLC include: To promote technical know-how and entrepreneurial skills for self employment, To facilitate wider outreach of agricultural technologies, To offer Agricultural Education to special groups of rural people in general, and school dropouts, small and marginal farmers and women in particular, To provide innovative, open system of education by using distance learning and teaching methods supported and enabled by modern Information Communication Technology (ICT), and To facilitate exchange and sharing of Agricultural information, Knowledge and skills among the farming fraternity of the State. Terms and conditions : Certificate course will be for a period of 3 months or 6 months depending on the course content Persons who can read and write Telugu are eligible for Certificate courses A person can join one course at a time. There is no age limit to undergo the certificate programme but should have studied minimum of 6th standard Krishi vigyana kendras in each district have been identified for Personal contact classes for easy access to the participants. The contact classes for certificate courses will be conducted on every 3rd Friday of each month i.e, One contact class@ 3 hrs session per month. Therefore total 3 contact classes(9 hrs) and one session for examination. Registered member can opt for his preferred KVK for attending contact classes. 20 participants will be enrolled in each batch per programme. A minimum of 10 members must enroll or the course will be cancelled. Cent percent attendance for contact classes is compulsory. Two certificate courses may be handled by each KVK simultaneously. One course in the forenoon and another in the afternoon of every 3rd Friday of every month for three months. Reading materials will be provided to the participants at the beginning of the course. All certificate courses will be offered twice a year. The courses will include theoretical sessions , practical sessions , Field studies and Exposure visits Contact number of registered member is important for direct communication from ODLC Change of address or phone number of registered member is to be informed immediately Certificate course programme is non residential and lunch will be provided during contact classes. Registration Interested candidates can download the application from angrau website(www.angrau.ac.in) or directly contact the ODLC at university head qrts(angrau.odlc@gmail.com), Ph : 8008788776. Filled in application(Registration form) along with the fees paid in the form of DD/M.O drawn in favour of OPEN AND DISTANCE LEARNING CENTRE , ANGRAU , payable at Guntur , A.P should reach OPEN DISTANCE LEARNING CENTRE , O/O DEAN OF AGRICULTURE , ACHARYA N G RANGA AGRICULTURAL UNIVERSITY , ADMINISTRATIVE OFFICE BUILDING , LAM , GUNTUR – 522 034. Registration fee is not refundable or transferable Evaluation pattern At the end of the course feed back and evaluation will be done. The pattern of evaluation will be in form of Quiz , Individual assignments after every contact class and Exam at the end of the course. Certificates will be awarded only after meeting at least 50 percent of the requirement. Note : After meeting the requirements of Attendance and Examination marks,participants will be awarded\r\nwith certificates. ANGRAU Certificate does not guarantee job in any organisation. ANGRAU is not responsible for postal delay or non reach of letters etc. ANGRAU - OPEN AND DISTANCE LEARNING CENTRE Certificate Courses for the Academic year 2024 - 25  -  Click Here REGISTRATIONS OPEN FOR ONLINE CERTIFICATE COURSES IN TELUGU-  BEEKEEPING, MILLETS PRODUCTION & PROCESSING, AND ORGANIC MANURES, FERTILIZERS & VERMICOMPOST PREPARATION\r\n                                           \r\n                                            ( LAST DATE FOR REGISTRATION 30 SEPTEMBER 2024 ) Registration Form (English) Registration Form (Telugu) Guidelines (English) Guidelines (Telugu) Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012025 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/Publications.aspx": "ANGRAU Home Publications Publications Budget Estimates Budget Estimates 2023-24 Budget Estimates 2021-22 Annual Report Annual Report 2020 - 2021 Annual Report 2019 - 2020 Annual Report 2018 - 2019 Annual Report 2017 - 2018 Annual Report 2016 - 2017 Annual Report 2015 - 2016 E-News Letter Vol 8(3) July-September, 2024 Vol 8(2) April-June, 2024 Vol 8(1) Jan-March, 2024 Vol 7(4) October-December, 2023 Vol 7(3) July-September, 2023 Vol 7(2) April-June, 2023 Vol 7(1) January-March, 2023 Vol 6(4) October-December, 2022 Vol 6(3) July-September, 2022 Vol 6(2) April-June, 2022 Vol 6(1) January-March, 2022 Vol 5(1) January-March, 2021 Vol 5(2) April-June, 2021 Vol 5(3) July-September, 2021 Vol 5(4) October-December, 2021 Journal of Research, ANGRAU The Journal of Research ANGRAU Vol 52(1) Jan-March, 2024 Journal of Research, Vol 51(4) ANGRAU October-December, 2023 Journal of Research, Vol 51(3) ANGRAU July-Sept, 2023 Journal of Research, ANGRAU April-June, 2023 Journal of Research, ANGRAU January - March, 2023 Journal of Research, ANGRAU October - December, 2022 Journal of Research, ANGRAU July - September, 2022 Journal of Research, ANGRAU April - June, 2022 Journal of Research, ANGRAU January - March, 2022 Journal of Research, ANGRAU January-March, 2021 Journal of Research, ANGRAU April-June, 2021 Journal of Research, ANGRAU July-September, 2021 Journal of Research, ANGRAU October-December, 2021 Journal of Research, ANGRAU January-March, 2020 Journal of Research, ANGRAU April-June, 2020 Journal of Research, ANGRAU July-September, 2020 Journal of Research, ANGRAU October-December, 2020 Vyavasayam Magazine Vyavasayam Magazine, October 2023 Vyavasayam Magazine, September 2023 Vyavasayam Magazine, August 2023 Vyavasayam Magazine, July 2023 Vyavasayam Magazine, June 2023 Vyavasayam Magazine, April 2023 Vyavasayam Magazine, March 2023 Vyavasayam Magazine, February 2023 Vyavasayam Magazine, January 2023 Vyavasayam Magazine, January 2022 Vyavasayam Magazine,  February 2022 Vyavasayam Magazine,  March 2022 Vyavasayam Magazine,  April 2022 Vyavasayam Magazine, May 2022 Vyavasayam Magazine, June 2022 Vyavasayam Magazine, July 2022 Vyavasayam Magazine, August 2022 Vyavasayam Magazine, September 2022 Vyavasayam Magazine, October 2022 Vyavasayam Magazine, November 2022 Vyavasayam Magazine, December 2022 Vyavasaya Panchangam VYAVASAYA PANCHANGAM 2022-23 Crop Diagnostic Bulletins Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012026 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/Revised_Portal.aspx": "ANGRAU Home Portals Portals Online admissions Undergraduate courses Postgraduate/Ph.D. Courses 2/3 Polytechnic diploma courses Payment Gateway Payment Gateway - ERP Student Fee Collection PFMS Biotech Kisan Hub ANGRAU e-Library Anti-Plagiarism DigiLocker NAD Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012027 Designed and Developed By",
    "https://angrau.ac.in/downloads/Digilocker/Digilocker.pdf": "",
    "https://www.angraualumni.com/": "The Official Alumni Network of Acharya N G Ranga Agricultural University We use Cookies to track page analytics and to keep you logged in. By continuing to use this website, you agree to our use of cookies as explained in our Cookie Policy . Please read our Cookie Policy for more information on how we use Cookies and process to disable them. I Understand Welcome to The Official Alumni Network of ANGRAU Newsroom Events Jobs Gallery Latest Members Acharya N G Ranga Agricultural University Facebook Twitter LinkedIn YouTube Powered By Copyright © 2024 Disclaimer Terms of Use Privacy Policy Alumni Directory Feedback",
    "https://angrau.ac.in/#lawn-care": "ANGRAU Previous Next EVENTS/FLASH NEWS Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 Click Here Reopening of admissions into specified major subject groups of PG courses Click Here Application cum information brochure for admission into B.sc (Hons) Community science for AY 2024-25 Left Over Seats - Last date for submission of application - 18-11-2024\r\nManual counseling on 18-11-2024 at Krishna Auditorium, RARS, ANGRAU, Lam, Guntur-522 034 (Final phase) Click Here Application cum information brochure for UG admissions under NRI / in lieu of NRI AY 2024-25 Left Over Seats - Last date for submission of application -  18-11-2024 Manual counseling on 19-11-2024 at O/o Controller of Examinations, Administrative Office, ANGRAU, Lam, Guntur-522 034 - (Final phase) Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 Click Here Third Counseling (Manual) for admission into B.Sc (Hons) Agriculture / B.Tech (Food Technology) courses of ANGRAU for AY 2024-25 from 04-11-2024 to 08-11-2024 at Krishna Auditorium / APGC Seminar Hall, RARS, Lam farm, ANGRAU, Guntur Click Here Public Notice for Ph.D. Application extension Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click here Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks from 17-10-2024 to 22-10-2024 Click Here Career Advancement Scheme - Calling of applications for 5th to 7th batches during the period of eligibility form 01.01.2023 to 30.06.2024 - Cancelled Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 Click Here PG and Ph.D Admissions for the  Academic year 2024-25 Click Here CAREERS Click Here Inviting the application for admission into the NRI / In lieu of NRI quota in P.G and Ph.D Programmes for the Academic Year 2024-25 Click Here ANGRAU AGRICET 2024 Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Diploma Registration Link.. Click Here National Anti Ragging Helpline Click Here Viksit Bharat Click Here Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 - Click Here Reopening of admissions into specified major subject groups of PG courses - Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 - Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 - Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 - Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks - Tentatively from 17-10-2024 to 22-10-2024 First counseling (Manual) for Admission into PG & Ph.D. Programme under NRI/in lieu of NRI Quota for the Academic Year 2024-25 on 09-10-2024. Master question papers with Final keys for AGRICET 2024 uploaded Time limit for submission of online application for PG and Ph.D Admissions for the Academic Year 2024-25 is extended up to 10-10-2024 at 11:59 PM PG and Ph.D Admissions for the  Academic year 2024-25 - Click Here National Anti Ragging Helpline - Click Here PG and Ph.D Admissions for the Academic Year 2024-25 Under NRI / In lieu of NRI Quota - Click Here Application cum information brochure for admissions into B.Sc. (Hons) Community Science AY 2024-25 Last Date 29-07-2024 - Extended upto 30-08-2024 - Click Here 12 days Agricultural Drone Pilot Training Programme at ANGRAU RPTO Application cum information brochure for admissions under NRI / in lieu of NRI AY 2024-25 - Last date 25-07-2024 extended upto 13-08-2024 - Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Viksit Bharat @ 2047 Fulbright-Nehru and other Fulbright Fellowships for study, research, teaching and profesional development in the U.S. APPLY NOW! For details CLICK HERE ICAR - Accreditation Certificates NIRF Live Meetings Circulars/Notifications Regulations RTI act SC/ST Cell Women Protection Cell Agricultural Market Intelligence IDP Open Distance Learning Centre (ODLC) Publications Portals Digilocker - NAD/ABC Alumni Awards & Honours IPR & Patents ANGRAU Agri Business Incubator Application Form to be a new Voter Study in India (SII)(for Foreign Students) Vice-Chancellor’s Message It is a matter of immense pleasure and privilege to be part of an esteemed alma mater Acharya N.G. Ranga Agricultural University in the capacity of Vice-Chancellor. Under dynamic leadership of predecessor Vice-Chancellors of ANGRAU, the state of Andhra Pradesh has witnessed quantum leap in the food productivity and production through agro-climate based, location specific research strategies of multi-faceted crops covering cereals, pulses, oilseeds, major and minor millets. Read More Dr. R. Sarada Jayalakshmi Devi Vice - Chancellor ADMISSIONS AY 2024-25 Click Here LATEST RELEASED VARIETIES / TECHNOLOGIES Click Here ANGRAU CROP VARIETIES Click Here ANGRAU TECHNOLOGIES Click Here 4 UG Programmes 22 PG Programmes 16 Ph.D. Programmes 4 Diploma Courses 12 Constituent Colleges 6 Affiliated Colleges 21 Constitutent Polytechnics 59 Affiliated Polytechnics 6 Regional Agricultural Research Stations 27 Research Stations 37 AICRP Schemes 26 KVKs(13) DAATTCs(13) LATEST ANNOUNCEMENTS Careers ACADEMIC CALENDAR / EXAMS Tenders Click Here for more Applications and Walkin Interviews Click Here E- Procurement tenders are invited from the printer and publisher for designing, printing and supply of Vyavasaya Panchangam 2025–26 books and supply at Agricultural Information & Communication Centre, Acharya N. G. Ranga Agricultural University, Lam, Guntur, Andhra Pradesh on or before 30-11-2024 at 05:00 PM Click Here Click here for Academic Calendar/Exams Click Here OUR GALLERY Photo Gallery Video Gallery Electronic Wing Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in Farmer call Center : 1800-425-0430 farmercallcentre@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012028 Designed and Developed By ×",
    "https://angrau.ac.in/ANGRU/IPR_PATENTS.aspx": "ANGRAU HOME IPR & PATENTS IPR & PATENTS Patents Granted S No Name of Machinery/ Process Technology/Technology Patent No Year of grant Names of Inventors Place where invention took place Patent certificate 1. Pneumatic Pressure parboiling system 210736 2007 Dr. PVK. Jagannadha Rao AICRP on PHET, RARS, Anakapalle 2 Manufacturing of cane jaggery in crystal form 361025 2021 Dr. PVK. Jagannadha Rao AICRP on PHET, RARS, Anakapalle 3 Process for preparing dehydrated fruit bar from prickly pear fruits (Opuntia ficus Indica) 367043 2021 Dr. S. Chenna Kesava Reddy Sucharitha Kumaram Venkata Syamala .B Dr. N. Eswara Reddy Dr. S. Kaleemullah SV University, Tirupathi College of Food Science & Technology, Pulivendula 4 Mechanized jaggery granulator for preparing jaggery granules 382165 2021 Dr. PVK. Jagannadha Rao, S. Ramakrishna Rao Alluri Padma Raju Pamidi Sridevi Pamidi Jamuna AICRP on PHET, RARS, Anakapalle 5 PRODUCTION OF ALCOHOL (NATUROHOL) FROM AGAVE ALBOMARGINATA 395370 2022 CHENNA KESAVA REDDY S, RAVEENDRA REDDY M, JALARAMA REDDY K, LAKSHMI KANTHA REDDY C, D VENKATA RAMANA, RAJKUMAR U, SUCHARITHA K, DIVI VENKATA RAMANA SAIGOPAL, KALEEMULLAH SHAIK, P VINOD KUMAR and SYAMALA B SV University, Tirupathi & College of Food Science and Technology, Pulivendula 6 MECHANIZED SYSTEM FOR PREPARING PAER SWEET (POOTHAREKULU) FILMS 406007 2022 Dr. P. V. K. Jagannadha Rao K. Raja Reddy Alluri Padma Raju P. Sreedevi AICRP on PHET, RARS, Anakapalle 7 A PROCESS FOR MANUFACTURING OF BLENDED FRUIT SQUASH WITH PRICKLY PEAR (OPUNTIA FICUS INDICA AND OPUNTIA DILLENII) FRUIT JUICE AND LEMON JUICE 411468 2022 CHENNA KESAVA REDDY SANGATI, SUCHARITHA KUMARAM VENKATA, MANJULA BAYAPPA, DANDU KAMAKSHI GARI VENKATA RAMANA, RAVEENDRA REDDY MALLELA, SYAMALA BOREDDY D.ST – PURSE CENTRE, S.V.UNIVERSITY, COLLEGE OF FOOD SCIENCE AND TECHNOLOGY, PULIVENDULA 8 Mechanized jaggery granulator for preparing jaggery granules An In-vivo Method for determination of Glycemic index and Kit there of 536180 2021 1) Sandeep Raja Donepudi, 2) Sridevi Peketi, 3) Krishna Veni Badugu, 4) Vishnu Vardhan Sidlagatta, 5) John Wesley Bandi, 6) Swapna Motamarri AICRP on PHET, PHTC, Bapatla 9 Chilli Compaction-Cum-Bagging Unit 403517-001 2023 Dr S. Vishnuvardhan, Dr B. john Wesley, Sri. D. Sandeep Raja, Dr V. Vasudeva Rao, Dr B.V.S. Prasad AICRP on PHET, PHTC, Bapatla Patents under Process S No Name of Machinery/ Process Technology/Technology Patent file no Names of Inventors Place where invention took place Status 1 Polymer-Pulley driven Centrifugal pump 201841006626/CHE/2018 Dr. A. Rama Rao Dr. G. Ravibabu Dr. NTR College of Agri Engg, Bapatla First examination report- Reply submitted 2 Diablite Smart Rice Cooker 405194-001 Sri. D. Sandeep Raja, Dr V. Vasudeva Rao, Dr B.V.S. Prasad AICRP on PHET,PHTC, Bapatla Application Filed 3 On-Farm Dry Aeration Bin For Paddy 403515-001 Dr S.Vishnuvardhan, Dr B. john Wesley, Sri. D. Sandeep Raja, Dr S.V.S. Gopala Swamy, Dr V. Vasudeva Rao, Dr B.V.S. Prasad AICRP on PHET,PHTC, Bapatla Application Filed Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012029 Designed and Developed By",
    "https://www.angraurabitpt.org/": "Failed to retrieve data",
    "https://www.nvsp.in/": "Voters' Services Portal You need to enable JavaScript to run this app.",
    "https://www.studyinindia.gov.in/admission/registrations": "Studying Abroad Made Easy with Study in India Program Register Student Register Institute Register Login Student Login Institute Login Visa/Mission Login FRRO Login ICCR Login Login Register Study In India About Study In India 10 Reasons to Study In India Indian Higher Education Discover India Things To Do In India Quick Facts Emerging India Know India Courses State-wise Course Details Scholarships & Fellowships ASEAN Fellowship ICCR Scholarships COMPEX Scholarship Programme for Diaspora Children (SPDC) Indian Technical and Economic Cooperation Programme(ITEC) Pillars of Strength India Rankings (NIRF) Institute of Eminence (IoE) Institute of National Importance (INI) National Assessment and Accreditation Council (NAAC) National Board of Accreditation (NBA) Regulatory Bodies in Higher Education Premier Institutes 1600+ Courses 2600+ NOTE: Please fill all your basic information carefullly as you can not change/update this information later. -- Country -- Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Indian Ocean Territory British Virgin Islands Brunei Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos [Keeling] Islands Colombia Comoros Cook Islands Costa Rica Croatia Cuba curacao Cyprus Czechia Democratic Republic of the Congo Denmark Djibouti Dominica Dominican Republic Dominican Republic Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Federated States of Micronesia Fiji Finland France French Guiana French Polynesia Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Honduras Hong Kong Hungary Iceland Indonesia Iran Iraq Ireland Isle of Man Israel Italy Ivory Coast Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Northern Mariana Islands Norway Oman Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Islands Poland Portugal Puerto Rico Puerto Rico Qatar Republic of the Congo Reunion Romania Russia Rwanda Saint Barthélemy Saint Helena Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Scotland Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Korea South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu U.S. Minor Outlying Islands U.S. Virgin Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Vatican City Venezuela Vietnam Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Gender Male Female Other --Country code for Mobile No-- Afghanistan (93) Aland Islands (358) Albania (355) Algeria (213) American Samoa (1-684) Andorra (376) Angola (244) Anguilla (1-264) Antarctica (672) Antigua and Barbuda (1-268) Argentina (54) Armenia (374) Aruba (297) Australia (61) Austria (43) Azerbaijan (994) Bahamas (1-242) Bahrain (973) Bangladesh (880) Barbados (1-246) Belarus (375) Belgium (32) Belize (501) Benin (229) Bermuda (1-441) Bhutan (975) Bolivia (591) Bosnia and Herzegovina (387) Botswana (267) Brazil (55) British Indian Ocean Territory (246) British Virgin Islands (1-284) Brunei (673) Bulgaria (359) Burkina Faso (226) Burundi (257) Cambodia (855) Cameroon (237) Canada (1) Cape Verde (238) Cayman Islands (1-345) Central African Republic (236) Chad (235) Chile (56) China (86) Christmas Island (61) Cocos [Keeling] Islands (61) Colombia (57) Comoros (269) Cook Islands (682) Costa Rica (506) Croatia (385) Cuba (53) curacao (599) Cyprus (357) Czechia (420) Democratic Republic of the Congo (243) Denmark (45) Djibouti (253) Dominica (1-767) Dominican Republic (1-809) Dominican Republic (1-829) Dominican Republic (1-849) East Timor (670) Ecuador (593) Egypt (20) El Salvador (503) Equatorial Guinea (240) Eritrea (291) Estonia (372) Ethiopia (251) Falkland Islands (500) Faroe Islands (298) Federated States of Micronesia (691) Fiji (679) Finland (358) France (33) French Guiana (594) French Polynesia (689) Gabon (241) Gambia (220) Georgia (995) Germany (49) Ghana (233) Gibraltar (350) Greece (30) Greenland (299) Grenada (1-473) Guadeloupe (590) Guam (1-671) Guatemala (502) Guernsey (44-1481) Guinea (224) Guinea-Bissau (245) Guyana (592) Haiti (509) Honduras (504) Hong Kong (852) Hungary (36) Iceland (354) India (91) Indonesia (62) Iran (98) Iraq (964) Ireland (353) Isle of Man (44-1624) Israel (972) Italy (39) Ivory Coast (225) Jamaica (1-876) Japan (81) Jersey (44-1534) Jordan (962) Kazakhstan (7) Kenya (254) Kiribati (686) Kosovo (383) Kuwait (965) Kyrgyzstan (996) Laos (856) Latvia (371) Lebanon (961) Lesotho (266) Liberia (231) Libya (218) Liechtenstein (423) Lithuania (370) Luxembourg (352) Macao (853) Macedonia (389) Madagascar (261) Malawi (265) Malaysia (60) Maldives (960) Mali (223) Malta (356) Marshall Islands (692) Martinique (596) Mauritania (222) Mauritius (230) Mayotte (262) Mexico (52) Moldova (373) Monaco (377) Mongolia (976) Montenegro (382) Montserrat (1-664) Morocco (212) Mozambique (258) Myanmar (95) Namibia (264) Nauru (674) Nepal (977) Netherlands (31) Netherlands Antilles (599) New Caledonia (687) New Zealand (64) Nicaragua (505) Niger (227) Nigeria (234) Niue (683) Norfolk Island (672) North Korea (850) Northern Mariana Islands (1-670) Norway (47) Oman (968) Palau (680) Palestine (970) Panama (507) Papua New Guinea (675) Paraguay (595) Peru (51) Philippines (63) Pitcairn Islands (64) Poland (48) Portugal (351) Puerto Rico (1-787) Puerto Rico (1-939) Qatar (974) Republic of the Congo (242) Reunion (262) Romania (40) Russia (7) Rwanda (250) Saint Barthélemy (590) Saint Helena (290) Saint Kitts and Nevis (1-869) Saint Lucia (1-758) Saint Martin (590) Saint Pierre and Miquelon (508) Saint Vincent and the Grenadines (1-784) Samoa (685) San Marino (378) Sao Tome and Principe (239) Saudi Arabia (966) Scotland (44) Senegal (221) Serbia (381) Seychelles (248) Sierra Leone (232) Singapore (65) Sint Maarten (1-721) Slovakia (421) Slovenia (386) Solomon Islands (677) Somalia (252) South Africa (27) South Georgia and the South Sandwich Islands (500) South Korea (82) South Sudan (211) Spain (34) Sri Lanka (94) Sudan (249) Suriname (597) Svalbard and Jan Mayen (47) Swaziland (268) Sweden (46) Switzerland (41) Syria (963) Taiwan (886) Tajikistan (992) Tanzania (255) Thailand (66) Togo (228) Tokelau (690) Tonga (676) Trinidad and Tobago (1-868) Tunisia (216) Turkey (90) Turkmenistan (993) Turks and Caicos Islands (1-649) Tuvalu (688) U.S. Minor Outlying Islands (246) U.S. Virgin Islands (1-340) Uganda (256) Ukraine (380) United Arab Emirates (971) United Kingdom (44) United States (1) Uruguay (598) Uzbekistan (998) Vanuatu (678) Vatican City (379) Venezuela (58) Vietnam (84) Wallis and Futuna (681) Western Sahara (212) Yemen (967) Zambia (260) Zimbabwe (263) I would like to receive updates, reminders and notifications on my contact number. I accept the terms of privacy policy and would like to receive further updates about programme. Register Already have an account? Login Home About Us Reasons to Study in India Eligibility Criteria Study in India Brochure Quick Facts 5 Steps Local Support List of Partner Institutes Onboarding & FRRO Plan your Budget Contact Us Join our mailing list Circulars FAQ PRIVACY POLICY SITE MAP © 2023 Study In India. All Rights Reserved. Apply Now Apply Now",
    "https://angrau.ac.in/ANGRU/VC_Message.aspx": "ANGRAU About Us Vice-Chancellor Message Vice-Chancellor's Message Dr. R. Sarada Jayalakshmi Devi Vice-Chancellor It is a matter of immense pleasure and privilege to be part of an esteemed alma mater Acharya N.G. Ranga Agricultural University in the capacity of Vice-Chancellor. Under dynamic leadership of predecessor Vice-Chancellors of ANGRAU, the state of Andhra Pradesh has witnessed quantum leap in the food productivity and production through agro-climate based, location specific research strategies of multi-faceted crops covering cereals, pulses, oilseeds, major and minor millets. The contribution of ANGRAU through a slew of technological interventions in developing new varieties, in ushering and transforming the Andhra Pradesh into “Rice Bowl of India” is phenomenal. India has 4% of world water resources occupying 2.5% of the total land area of the world supports 18% of world’s population. With rapid urbanization, booming economic and population growth, changing food consumption and changing land use pattern coupled with climate change poses threat to per capita availability of water and land resources and food production to cope up with the demand. As per international norms, countries with per capita water availability less than 1700 m3/year is categorized as water stressed. With per capita availability of around 1400 m3/year, India is definitely as water stressed. Studies project that per capita availability of water dwindle to 1191 m3/year by 2050, that eventually lead India to become water scarce country and there by affecting food production. Keeping this in view, Government of Andhra Pradesh and ANGRAU committed to achieve sustainable development goals through engineering and agronomic interventions to improve water use efficiency by 20% and to improve yield potential of crop varieties through biotechnological interventions to eye targeted food production of 450 MT by 2050. “Enter to learn and leave to serve” is the dictum that drives ANGRAU to be a pioneer in preparing students to meet challenges around the globe through quality education with ethical and moral values. Faculty members of the University are highly qualified and nationally renowned, who have been continuously engaged in the maintenance and enhancement of student centric learning environment through innovative pedagogy, form the backbone of the University. ANGRAU has been the first University in the country to design RAWEP and Experiential learning for students to nurture zeal in them to develop entrepreneurship skills. With tripartite mandate of teaching, research and extension through innovative methods are regarded as our pillars of success that is evident from national level JRFs, GATE ranks bagged by our students. Our faculty teach basic and applied sciences to the students emphasizing the field problems faced by the farmers and making the students to learn techniques of problem solving ability and farmer’s issues in mind. Post bifurcation, ANGRAU is continuously striving hard to improve its infrastructural facilities, maintain strong institutional linkages with reputed national and international institutions, constantly updating human resources knowledge on frontier niche areas like Nanotechnology, Bioinformatics and Artificial Intelligence, Machine learning” to overcome challenges in agriculture and enhancing farmer’s income through sustainable farming systems approach, intensive research in agriculture and engineering. With the above initiatives and endeavours, ANGRAU shall be marching ahead in the right direction, providing a holistic agricultural education to the budding agri and allied graduates and playing a decisive role in growth of agricultural sector in our state. All the faculty of ANGRAU shall rededicate themselves with great zeal and enthusiasm to provide world class education to the students and train them to be globally professionals and develop seed varieties combating biotic and abiotic stresses through safe approaches; technologies and machinery to make agriculture to be sustainable and profitable through ANGRAU’s robust outreach programmes. ANGRAU extend a warm invitation to all stakeholders and well-wishers to join us in our honest efforts and endeavour to make this great institution as an enviable destination for pursuing their dreams in the realm of higher agricultural education and research. Welcome to the portal of Acharya N.G. Ranga Agricultural University. Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012031 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/ADMISSIONS_AY_2022_23.aspx": "ANGRAU Home ADMISSIONS AY 2024-25 ADMISSIONS AY 2024-25 2/3 POLYTECHNIC DIPLOMA COURSES Click Here B.SC (HONS) AGRICULTURE & B.TECH (FOOD TECHNOLOGY) BI.P.C STREAM ONLY (FARMER & NON-FARMER QUOTA ONLY) Click Here B.TECH (AG. ENGG.) B.TECH (FOOD TECH) M.P.C STREAM ONLY Click Here NRI/IN LIEU OF NRI UG ADMISSIONS B.Sc(HONS) AGRICULTURE Click Here B.SC (HONS) COMMUNITY SCIENCE Click Here POSTGRADUATE / Ph.D Click Here AGRICET-2024 ADMISSION INTO B.Sc(HONS.) AGRICULTURE Click Here NRI/IN LIEU OF NRI QUOTA PG/Ph.D ADMISSIONS Click Here Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012033 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/Latest_Released_Veraities.aspx": "ANGRAU Home New Released Varieties NEW RELEASED VARIETIES LIST OF NEW CROP VARIETIES/HYBRIDS RELEASED DURING 2020 AT STATE LEVEL S.No Crop No. of Varieties Variety Released 1 RICE 4 BHAVATHI (BPT 2782) SASYA (BPT 2411) NELLORE SIRI (NLR 4001) NELLORE SUGANDHA (NLR 40054) 2 FINGERMILLET 1 GOWTHAMI (PR 1045) 3 FOXTAIL MILLET 2 GARUDA (SiA 3223) RENADU (SiA 3223) 4 PULSES 3 KRISHNA (LRG 105) TIRUPATI KANDI-59 (TRG 59) NANDYALA GRAM-452 (NBeG 452) 5 SUGARCANE 2 VASISTA (2009A 107 (COA 14321)) NAVEEN (2009A 252 (COA 14323)) Total 12 LIST OF NEW CROP VARIETIES/HYBRIDS RELEASED DURING 2020 AT NATIONAL LEVEL S.No Crop No. of Varieties Variety Released 1 MILLETS 1 INDRAVATHI (CFMV 1) 2 PULSES 3 SOWBHAGYA (LRG 133-33) NANDYALA GRAM-810 (NBeG 810) HORSEGRAM (ATPHG-11) 3 GROUNDNUT 1 PRAGATHI (TCGS 894) 4 TOBACCO 1 ABD-1 Total 6 LIST OF CROP VARIETIES RELEASED BY CVRC AT NATIONAL LEVEL DURING 2021 S.No Crop No. of Varieties Variety Released 1 PADDY 3 MTU 1212 MTU 1280 MTU 1281 2 BENGALGRAM 1 NBeG-857 (NANDYAL GRAM) 3 HORSEGRAM 1 APTHG-11 (ANANTHA VULAVA-1) 4 COTTON 3 NDLH 2005-4 NDLH 2028-2 NDLH 2051-1 Total 8 LIST OF NEW CROP VARIETIES/HYBRIDS RELEASED AND NOTIFIED DURING 2022 AT STATE LEVEL S.No Crop No. of Varieties Variety Released 1 RICE 3 MTU-1318 MTU-1232 MCM-103 2 MILLETS FINGER MILLET 2 VR-1099 FOXTAIL MILLET SiA-3159 3 PULSES BLACKGRAM 4 LBG-884 GREENGRAM LGG-574 GREENGRAM LGG-607 BENGALGRAM NBeG-776 4 GROUNDNUT 1 TCGS-1694 Total 10 LIST OF NEW CROP VARIETIES/HYBRIDS RELEASED AND NOTIFIED DURING 2022 AT CENTRAL LEVEL S.No Crop No. of Varieties Variety Released 1 RICE 4 MTU-1273 MTU-1293 MTU-1310 MTU-1321 2 FINGER MILLET 1 CFMV-4 3 COTTON 2 LHDP COTTON-5 NDLH-2035-5 Total 7 Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012034 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/ANGRAU_CROP_VARIETIES.aspx": "ANGRAU Home ANGRAU CROP VARITIES ANGRAU CROP VARITIES Paddy Paddy Redgram Redgram Greengram Greengram Blackgram Blackgram Bengalgram No data Sugarcane SugarCane Groundnut Groundnut Sesamum No data Sorghum No data Maize No data Cotton Cotton Foxtail No data Rajmash No data Niger No data Tobacco No data Finger Millet Finger Millet Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012035 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/ANGRAU_Technologies.aspx": "ANGRAU Home ANGRAU Technologies ANGRAU Technologies Crop Production No data BioTechnology No data Nano Technology No data Farm Mechanization No data Post Harvest Engineering and Technology No data Land and Water Management No data Community Science No data Social Sciences No data Technologies developed in different Agro-Climatic Zones 2015-16 to 2021-22 Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012036 Designed and Developed By",
    "https://angrau.ac.in/#Section1": "ANGRAU Previous Next EVENTS/FLASH NEWS Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 Click Here Reopening of admissions into specified major subject groups of PG courses Click Here Application cum information brochure for admission into B.sc (Hons) Community science for AY 2024-25 Left Over Seats - Last date for submission of application - 18-11-2024\r\nManual counseling on 18-11-2024 at Krishna Auditorium, RARS, ANGRAU, Lam, Guntur-522 034 (Final phase) Click Here Application cum information brochure for UG admissions under NRI / in lieu of NRI AY 2024-25 Left Over Seats - Last date for submission of application -  18-11-2024 Manual counseling on 19-11-2024 at O/o Controller of Examinations, Administrative Office, ANGRAU, Lam, Guntur-522 034 - (Final phase) Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 Click Here Third Counseling (Manual) for admission into B.Sc (Hons) Agriculture / B.Tech (Food Technology) courses of ANGRAU for AY 2024-25 from 04-11-2024 to 08-11-2024 at Krishna Auditorium / APGC Seminar Hall, RARS, Lam farm, ANGRAU, Guntur Click Here Public Notice for Ph.D. Application extension Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click here Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks from 17-10-2024 to 22-10-2024 Click Here Career Advancement Scheme - Calling of applications for 5th to 7th batches during the period of eligibility form 01.01.2023 to 30.06.2024 - Cancelled Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 Click Here PG and Ph.D Admissions for the  Academic year 2024-25 Click Here CAREERS Click Here Inviting the application for admission into the NRI / In lieu of NRI quota in P.G and Ph.D Programmes for the Academic Year 2024-25 Click Here ANGRAU AGRICET 2024 Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Diploma Registration Link.. Click Here National Anti Ragging Helpline Click Here Viksit Bharat Click Here Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 - Click Here Reopening of admissions into specified major subject groups of PG courses - Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 - Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 - Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 - Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks - Tentatively from 17-10-2024 to 22-10-2024 First counseling (Manual) for Admission into PG & Ph.D. Programme under NRI/in lieu of NRI Quota for the Academic Year 2024-25 on 09-10-2024. Master question papers with Final keys for AGRICET 2024 uploaded Time limit for submission of online application for PG and Ph.D Admissions for the Academic Year 2024-25 is extended up to 10-10-2024 at 11:59 PM PG and Ph.D Admissions for the  Academic year 2024-25 - Click Here National Anti Ragging Helpline - Click Here PG and Ph.D Admissions for the Academic Year 2024-25 Under NRI / In lieu of NRI Quota - Click Here Application cum information brochure for admissions into B.Sc. (Hons) Community Science AY 2024-25 Last Date 29-07-2024 - Extended upto 30-08-2024 - Click Here 12 days Agricultural Drone Pilot Training Programme at ANGRAU RPTO Application cum information brochure for admissions under NRI / in lieu of NRI AY 2024-25 - Last date 25-07-2024 extended upto 13-08-2024 - Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Viksit Bharat @ 2047 Fulbright-Nehru and other Fulbright Fellowships for study, research, teaching and profesional development in the U.S. APPLY NOW! For details CLICK HERE ICAR - Accreditation Certificates NIRF Live Meetings Circulars/Notifications Regulations RTI act SC/ST Cell Women Protection Cell Agricultural Market Intelligence IDP Open Distance Learning Centre (ODLC) Publications Portals Digilocker - NAD/ABC Alumni Awards & Honours IPR & Patents ANGRAU Agri Business Incubator Application Form to be a new Voter Study in India (SII)(for Foreign Students) Vice-Chancellor’s Message It is a matter of immense pleasure and privilege to be part of an esteemed alma mater Acharya N.G. Ranga Agricultural University in the capacity of Vice-Chancellor. Under dynamic leadership of predecessor Vice-Chancellors of ANGRAU, the state of Andhra Pradesh has witnessed quantum leap in the food productivity and production through agro-climate based, location specific research strategies of multi-faceted crops covering cereals, pulses, oilseeds, major and minor millets. Read More Dr. R. Sarada Jayalakshmi Devi Vice - Chancellor ADMISSIONS AY 2024-25 Click Here LATEST RELEASED VARIETIES / TECHNOLOGIES Click Here ANGRAU CROP VARIETIES Click Here ANGRAU TECHNOLOGIES Click Here 4 UG Programmes 22 PG Programmes 16 Ph.D. Programmes 4 Diploma Courses 12 Constituent Colleges 6 Affiliated Colleges 21 Constitutent Polytechnics 59 Affiliated Polytechnics 6 Regional Agricultural Research Stations 27 Research Stations 37 AICRP Schemes 26 KVKs(13) DAATTCs(13) LATEST ANNOUNCEMENTS Careers ACADEMIC CALENDAR / EXAMS Tenders Click Here for more Applications and Walkin Interviews Click Here E- Procurement tenders are invited from the printer and publisher for designing, printing and supply of Vyavasaya Panchangam 2025–26 books and supply at Agricultural Information & Communication Centre, Acharya N. G. Ranga Agricultural University, Lam, Guntur, Andhra Pradesh on or before 30-11-2024 at 05:00 PM Click Here Click here for Academic Calendar/Exams Click Here OUR GALLERY Photo Gallery Video Gallery Electronic Wing Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in Farmer call Center : 1800-425-0430 farmercallcentre@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012037 Designed and Developed By ×",
    "https://angrau.ac.in/#Section3": "ANGRAU Previous Next EVENTS/FLASH NEWS Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 Click Here Reopening of admissions into specified major subject groups of PG courses Click Here Application cum information brochure for admission into B.sc (Hons) Community science for AY 2024-25 Left Over Seats - Last date for submission of application - 18-11-2024\r\nManual counseling on 18-11-2024 at Krishna Auditorium, RARS, ANGRAU, Lam, Guntur-522 034 (Final phase) Click Here Application cum information brochure for UG admissions under NRI / in lieu of NRI AY 2024-25 Left Over Seats - Last date for submission of application -  18-11-2024 Manual counseling on 19-11-2024 at O/o Controller of Examinations, Administrative Office, ANGRAU, Lam, Guntur-522 034 - (Final phase) Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 Click Here Third Counseling (Manual) for admission into B.Sc (Hons) Agriculture / B.Tech (Food Technology) courses of ANGRAU for AY 2024-25 from 04-11-2024 to 08-11-2024 at Krishna Auditorium / APGC Seminar Hall, RARS, Lam farm, ANGRAU, Guntur Click Here Public Notice for Ph.D. Application extension Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click here Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks from 17-10-2024 to 22-10-2024 Click Here Career Advancement Scheme - Calling of applications for 5th to 7th batches during the period of eligibility form 01.01.2023 to 30.06.2024 - Cancelled Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 Click Here PG and Ph.D Admissions for the  Academic year 2024-25 Click Here CAREERS Click Here Inviting the application for admission into the NRI / In lieu of NRI quota in P.G and Ph.D Programmes for the Academic Year 2024-25 Click Here ANGRAU AGRICET 2024 Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Diploma Registration Link.. Click Here National Anti Ragging Helpline Click Here Viksit Bharat Click Here Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 - Click Here Reopening of admissions into specified major subject groups of PG courses - Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 - Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 - Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 - Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks - Tentatively from 17-10-2024 to 22-10-2024 First counseling (Manual) for Admission into PG & Ph.D. Programme under NRI/in lieu of NRI Quota for the Academic Year 2024-25 on 09-10-2024. Master question papers with Final keys for AGRICET 2024 uploaded Time limit for submission of online application for PG and Ph.D Admissions for the Academic Year 2024-25 is extended up to 10-10-2024 at 11:59 PM PG and Ph.D Admissions for the  Academic year 2024-25 - Click Here National Anti Ragging Helpline - Click Here PG and Ph.D Admissions for the Academic Year 2024-25 Under NRI / In lieu of NRI Quota - Click Here Application cum information brochure for admissions into B.Sc. (Hons) Community Science AY 2024-25 Last Date 29-07-2024 - Extended upto 30-08-2024 - Click Here 12 days Agricultural Drone Pilot Training Programme at ANGRAU RPTO Application cum information brochure for admissions under NRI / in lieu of NRI AY 2024-25 - Last date 25-07-2024 extended upto 13-08-2024 - Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Viksit Bharat @ 2047 Fulbright-Nehru and other Fulbright Fellowships for study, research, teaching and profesional development in the U.S. APPLY NOW! For details CLICK HERE ICAR - Accreditation Certificates NIRF Live Meetings Circulars/Notifications Regulations RTI act SC/ST Cell Women Protection Cell Agricultural Market Intelligence IDP Open Distance Learning Centre (ODLC) Publications Portals Digilocker - NAD/ABC Alumni Awards & Honours IPR & Patents ANGRAU Agri Business Incubator Application Form to be a new Voter Study in India (SII)(for Foreign Students) Vice-Chancellor’s Message It is a matter of immense pleasure and privilege to be part of an esteemed alma mater Acharya N.G. Ranga Agricultural University in the capacity of Vice-Chancellor. Under dynamic leadership of predecessor Vice-Chancellors of ANGRAU, the state of Andhra Pradesh has witnessed quantum leap in the food productivity and production through agro-climate based, location specific research strategies of multi-faceted crops covering cereals, pulses, oilseeds, major and minor millets. Read More Dr. R. Sarada Jayalakshmi Devi Vice - Chancellor ADMISSIONS AY 2024-25 Click Here LATEST RELEASED VARIETIES / TECHNOLOGIES Click Here ANGRAU CROP VARIETIES Click Here ANGRAU TECHNOLOGIES Click Here 4 UG Programmes 22 PG Programmes 16 Ph.D. Programmes 4 Diploma Courses 12 Constituent Colleges 6 Affiliated Colleges 21 Constitutent Polytechnics 59 Affiliated Polytechnics 6 Regional Agricultural Research Stations 27 Research Stations 37 AICRP Schemes 26 KVKs(13) DAATTCs(13) LATEST ANNOUNCEMENTS Careers ACADEMIC CALENDAR / EXAMS Tenders Click Here for more Applications and Walkin Interviews Click Here E- Procurement tenders are invited from the printer and publisher for designing, printing and supply of Vyavasaya Panchangam 2025–26 books and supply at Agricultural Information & Communication Centre, Acharya N. G. Ranga Agricultural University, Lam, Guntur, Andhra Pradesh on or before 30-11-2024 at 05:00 PM Click Here Click here for Academic Calendar/Exams Click Here OUR GALLERY Photo Gallery Video Gallery Electronic Wing Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in Farmer call Center : 1800-425-0430 farmercallcentre@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012038 Designed and Developed By ×",
    "https://angrau.ac.in/#Section2": "ANGRAU Previous Next EVENTS/FLASH NEWS Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 Click Here Reopening of admissions into specified major subject groups of PG courses Click Here Application cum information brochure for admission into B.sc (Hons) Community science for AY 2024-25 Left Over Seats - Last date for submission of application - 18-11-2024\r\nManual counseling on 18-11-2024 at Krishna Auditorium, RARS, ANGRAU, Lam, Guntur-522 034 (Final phase) Click Here Application cum information brochure for UG admissions under NRI / in lieu of NRI AY 2024-25 Left Over Seats - Last date for submission of application -  18-11-2024 Manual counseling on 19-11-2024 at O/o Controller of Examinations, Administrative Office, ANGRAU, Lam, Guntur-522 034 - (Final phase) Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 Click Here Third Counseling (Manual) for admission into B.Sc (Hons) Agriculture / B.Tech (Food Technology) courses of ANGRAU for AY 2024-25 from 04-11-2024 to 08-11-2024 at Krishna Auditorium / APGC Seminar Hall, RARS, Lam farm, ANGRAU, Guntur Click Here Public Notice for Ph.D. Application extension Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click here Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks from 17-10-2024 to 22-10-2024 Click Here Career Advancement Scheme - Calling of applications for 5th to 7th batches during the period of eligibility form 01.01.2023 to 30.06.2024 - Cancelled Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 Click Here PG and Ph.D Admissions for the  Academic year 2024-25 Click Here CAREERS Click Here Inviting the application for admission into the NRI / In lieu of NRI quota in P.G and Ph.D Programmes for the Academic Year 2024-25 Click Here ANGRAU AGRICET 2024 Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Diploma Registration Link.. Click Here National Anti Ragging Helpline Click Here Viksit Bharat Click Here Final Mop Up Round on 18-11-2024 for admission into B.Sc. (Hons) Agriculture and B. Tech (Food Technology) for AY 2024-25 to registered candidates applied online with AP EAPCET 2024 Ranks  at Krishna Auditorium, RARS, Lam farm, ANGRAU, Guntur & Vacancy position will be displayed on university website on 15-11-2024 - Click Here Reopening of admissions into specified major subject groups of PG courses - Click Here Final Merit List of the MBA(AB) Applicants for Admission during the Academic Year 2024-25 - Click Here Change of Venue for PG Counselling Schedule on 07-11-2024 - Click Here Counselling Schedule and Final Merit List for PG Admissions for AY 2024-25 - Click Here Time limit for submission of PG and Ph.D. application under NRI /in lieu of NRI quota for the AY 2024-25 is extended upto 15-11-2024 - Click Here Online Registration for admission into B.Sc.(Hons) Agriculture through AGRICET 2024 Ranks - Tentatively from 17-10-2024 to 22-10-2024 First counseling (Manual) for Admission into PG & Ph.D. Programme under NRI/in lieu of NRI Quota for the Academic Year 2024-25 on 09-10-2024. Master question papers with Final keys for AGRICET 2024 uploaded Time limit for submission of online application for PG and Ph.D Admissions for the Academic Year 2024-25 is extended up to 10-10-2024 at 11:59 PM PG and Ph.D Admissions for the  Academic year 2024-25 - Click Here National Anti Ragging Helpline - Click Here PG and Ph.D Admissions for the Academic Year 2024-25 Under NRI / In lieu of NRI Quota - Click Here Application cum information brochure for admissions into B.Sc. (Hons) Community Science AY 2024-25 Last Date 29-07-2024 - Extended upto 30-08-2024 - Click Here 12 days Agricultural Drone Pilot Training Programme at ANGRAU RPTO Application cum information brochure for admissions under NRI / in lieu of NRI AY 2024-25 - Last date 25-07-2024 extended upto 13-08-2024 - Click Here Online Registration for admission into Polytechnic diploma courses offered by ANGRAU for the Academic year 2024-25 is enabled. Viksit Bharat @ 2047 Fulbright-Nehru and other Fulbright Fellowships for study, research, teaching and profesional development in the U.S. APPLY NOW! For details CLICK HERE ICAR - Accreditation Certificates NIRF Live Meetings Circulars/Notifications Regulations RTI act SC/ST Cell Women Protection Cell Agricultural Market Intelligence IDP Open Distance Learning Centre (ODLC) Publications Portals Digilocker - NAD/ABC Alumni Awards & Honours IPR & Patents ANGRAU Agri Business Incubator Application Form to be a new Voter Study in India (SII)(for Foreign Students) Vice-Chancellor’s Message It is a matter of immense pleasure and privilege to be part of an esteemed alma mater Acharya N.G. Ranga Agricultural University in the capacity of Vice-Chancellor. Under dynamic leadership of predecessor Vice-Chancellors of ANGRAU, the state of Andhra Pradesh has witnessed quantum leap in the food productivity and production through agro-climate based, location specific research strategies of multi-faceted crops covering cereals, pulses, oilseeds, major and minor millets. Read More Dr. R. Sarada Jayalakshmi Devi Vice - Chancellor ADMISSIONS AY 2024-25 Click Here LATEST RELEASED VARIETIES / TECHNOLOGIES Click Here ANGRAU CROP VARIETIES Click Here ANGRAU TECHNOLOGIES Click Here 4 UG Programmes 22 PG Programmes 16 Ph.D. Programmes 4 Diploma Courses 12 Constituent Colleges 6 Affiliated Colleges 21 Constitutent Polytechnics 59 Affiliated Polytechnics 6 Regional Agricultural Research Stations 27 Research Stations 37 AICRP Schemes 26 KVKs(13) DAATTCs(13) LATEST ANNOUNCEMENTS Careers ACADEMIC CALENDAR / EXAMS Tenders Click Here for more Applications and Walkin Interviews Click Here E- Procurement tenders are invited from the printer and publisher for designing, printing and supply of Vyavasaya Panchangam 2025–26 books and supply at Agricultural Information & Communication Centre, Acharya N. G. Ranga Agricultural University, Lam, Guntur, Andhra Pradesh on or before 30-11-2024 at 05:00 PM Click Here Click here for Academic Calendar/Exams Click Here OUR GALLERY Photo Gallery Video Gallery Electronic Wing Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in Farmer call Center : 1800-425-0430 farmercallcentre@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012039 Designed and Developed By ×",
    "https://angrau.ac.in/UPLOADS/TendersPDFs/ANGRAU Website for Vyavasayam Panchangam 2025-26.pdf": "",
    "https://angrau.ac.in/ANGRU/Admissions_Examinations.aspx": "ANGRAU Home Academic Calendar/Exams Academic Calendar/Exams Latest Updates Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012041 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/Photo_Gallery.aspx": "ANGRAU Home Photos Gallery PHOTOS GALLERY Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012042 Designed and Developed By",
    "https://angrau.ac.in/ANGRU/Video_Gallery.aspx": "ANGRAU Home Video Gallery VIDEO GALLERY Location Our services About Us Terms & Conditions Privacy Policy Contact us address Acharya N G Ranga Agricultural University Administrative Office, Lam, Guntur, Andhra Pradesh, 522 034 email registrar@angrau.ac.in © 2024 ANGRAU. All Rights Reserved. No. of Visitors: 1012043 Designed and Developed By",
    "https://angrauew.blogspot.com": "Blogger Sign in to continue to Blogger Email or phone Forgot email? Not your computer? Use a private browsing window to sign in. Learn more about using Guest mode Next Create account Afrikaans azərbaycan bosanski català Čeština Cymraeg Dansk Deutsch eesti English (United Kingdom) English (United States) Español (España) Español (Latinoamérica) euskara Filipino Français (Canada) Français (France) Gaeilge galego Hrvatski Indonesia isiZulu íslenska Italiano Kiswahili latviešu lietuvių magyar Melayu Nederlands norsk o‘zbek polski Português (Brasil) Português (Portugal) română shqip Slovenčina slovenščina srpski (latinica) Suomi Svenska Tiếng Việt Türkçe Ελληνικά беларуская български кыргызча қазақ тілі македонски монгол Русский српски (ћирилица) Українська ქართული հայերեն ‫עברית‬‎ ‫اردو‬‎ ‫العربية‬‎ ‫فارسی‬‎ አማርኛ नेपाली मराठी हिन्दी অসমীয়া বাংলা ਪੰਜਾਬੀ ગુજરાતી ଓଡ଼ିଆ தமிழ் తెలుగు ಕನ್ನಡ മലയാളം සිංහල ไทย ລາວ မြန်မာ ខ្មែរ 한국어 中文（香港） 日本語 简体中文 繁體中文 Help Privacy Terms"
}